zhans1099/stm32f107practice/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IN_KEY0_Pin GPIO_PIN_4
#define IN_KEY0_GPIO_Port GPIOE
#define LED2_Pin GPIO_PIN_5
#define LED2_GPIO_Port GPIOE
#define IN_RESET_Pin GPIO_PIN_8
#define IN_RESET_GPIO_Port GPIOF
#define IN_STOP_Pin GPIO_PIN_9
#define IN_STOP_GPIO_Port GPIOF
#define BH_G_Pin GPIO_PIN_3
#define BH_G_GPIO_Port GPIOC
#define BH_H_Pin GPIO_PIN_0
#define BH_H_GPIO_Port GPIOA
#define BH_E_Pin GPIO_PIN_1
#define BH_E_GPIO_Port GPIOA
#define BH_F_Pin GPIO_PIN_2
#define BH_F_GPIO_Port GPIOA
#define BH_C_Pin GPIO_PIN_3
#define BH_C_GPIO_Port GPIOA
#define BH_D_Pin GPIO_PIN_4
#define BH_D_GPIO_Port GPIOA
#define BH_A_Pin GPIO_PIN_5
#define BH_A_GPIO_Port GPIOA
#define BH_B_Pin GPIO_PIN_6
#define BH_B_GPIO_Port GPIOA
#define LED_R2_Pin GPIO_PIN_5
#define LED_R2_GPIO_Port GPIOC
#define LED_R_Pin GPIO_PIN_1
#define LED_R_GPIO_Port GPIOB
#define LED_G_Pin GPIO_PIN_2
#define LED_G_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_5
#define LED1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
